In [60]:
import pandas as pd

In [61]:
student = {
    "Name": ["Ankit", "Ashwani"," Akshansh", "Gaurav", "Krish"," Sarthak", "Swakshwar"],
    "Section": ["CH", "CH", "MP", "CH", "SS", "MP", "MP"],
    "Registration_Id": [12018329, 12016043, 12015923, 12014917, 12018275, 12018433, 12015939],
    "Registration_Id": ["12018329", "12016043", "12015923", "12014917", "12018275", "12018433", "12015939"],
    "City" : ['Fatehabad', "Bahadurgarh", "Gurgaon", "Lucknow", "Jaipur", "Ghaziabad", "Kolkata"],
    "State" : ["Harayana", "Harayana", "Harayana", "Uttar Pradesh", "Rajasthan" ,"Uttar Pradesh" ,"Kolkata"]
}

In [62]:
df = pd.DataFrame(student)

In [63]:
df

        Name Section Registration_Id         City          State
0      Ankit      CH        12018329    Fatehabad       Harayana
1    Ashwani      CH        12016043  Bahadurgarh       Harayana
2   Akshansh      MP        12015923      Gurgaon       Harayana
3     Gaurav      CH        12014917      Lucknow  Uttar Pradesh
4      Krish      SS        12018275       Jaipur      Rajasthan
5    Sarthak      MP        12018433    Ghaziabad  Uttar Pradesh
6  Swakshwar      MP        12015939      Kolkata        Kolkata

In [64]:
df.columns

Index(['Name', 'Section', 'Registration_Id', 'City', 'State'], dtype='object')

You can edit the column names using the same command

In [65]:
df.columns = ['Full_Name', 'Section', 'Registration_No.', 'City', 'State']

In [66]:
df

   Full_Name Section Registration_No.         City          State
0      Ankit      CH         12018329    Fatehabad       Harayana
1    Ashwani      CH         12016043  Bahadurgarh       Harayana
2   Akshansh      MP         12015923      Gurgaon       Harayana
3     Gaurav      CH         12014917      Lucknow  Uttar Pradesh
4      Krish      SS         12018275       Jaipur      Rajasthan
5    Sarthak      MP         12018433    Ghaziabad  Uttar Pradesh
6  Swakshwar      MP         12015939      Kolkata        Kolkata

In [67]:
 # If you want to edit some specifications, we use list comprehension
 df.columns = [x.upper() for x in df.columns]
 df

   FULL_NAME SECTION REGISTRATION_NO.         CITY          STATE
0      Ankit      CH         12018329    Fatehabad       Harayana
1    Ashwani      CH         12016043  Bahadurgarh       Harayana
2   Akshansh      MP         12015923      Gurgaon       Harayana
3     Gaurav      CH         12014917      Lucknow  Uttar Pradesh
4      Krish      SS         12018275       Jaipur      Rajasthan
5    Sarthak      MP         12018433    Ghaziabad  Uttar Pradesh
6  Swakshwar      MP         12015939      Kolkata        Kolkata

In [68]:
df.columns = df.columns.str.replace('_',' ')
df

   FULL NAME SECTION REGISTRATION NO.         CITY          STATE
0      Ankit      CH         12018329    Fatehabad       Harayana
1    Ashwani      CH         12016043  Bahadurgarh       Harayana
2   Akshansh      MP         12015923      Gurgaon       Harayana
3     Gaurav      CH         12014917      Lucknow  Uttar Pradesh
4      Krish      SS         12018275       Jaipur      Rajasthan
5    Sarthak      MP         12018433    Ghaziabad  Uttar Pradesh
6  Swakshwar      MP         12015939      Kolkata        Kolkata

In [69]:
df.rename(columns={'FULL NAME': 'NAME', 'REGISTRATION NO.': 'REGISTRATION_NO'}, inplace=True)
#  inplace required for the rename method

In [70]:
df

        NAME SECTION REGISTRATION_NO         CITY          STATE
0      Ankit      CH        12018329    Fatehabad       Harayana
1    Ashwani      CH        12016043  Bahadurgarh       Harayana
2   Akshansh      MP        12015923      Gurgaon       Harayana
3     Gaurav      CH        12014917      Lucknow  Uttar Pradesh
4      Krish      SS        12018275       Jaipur      Rajasthan
5    Sarthak      MP        12018433    Ghaziabad  Uttar Pradesh
6  Swakshwar      MP        12015939      Kolkata        Kolkata

#### Editing value in rows

In [71]:
df.loc[6] = ['Gyan', 'SS', '12017829', 'Varanasi' ,'Uttar Pradesh']

##### But it is not efficient since we have to change all the values of the row, What if someone wants to change specific columns only...

##### (Incase when the dataset have enormous amount of columns)

In [72]:
df.loc[2, ['STATE', 'CITY']] = ['DeLhi-NCR', 'Gurugram']
df

        NAME SECTION REGISTRATION_NO         CITY          STATE
0      Ankit      CH        12018329    Fatehabad       Harayana
1    Ashwani      CH        12016043  Bahadurgarh       Harayana
2   Akshansh      MP        12015923     Gurugram      DeLhi-NCR
3     Gaurav      CH        12014917      Lucknow  Uttar Pradesh
4      Krish      SS        12018275       Jaipur      Rajasthan
5    Sarthak      MP        12018433    Ghaziabad  Uttar Pradesh
6       Gyan      SS        12017829     Varanasi  Uttar Pradesh

In [73]:
df.loc[6,'NAME'] = "GyanSagar"

Another indexer (at) :- used for changing or looking up a single value (Used instead of loc for performance reason(maybe))

In [74]:
df.at[6,'NAME'] = "GyanSagar"

Changing values without using one of the indexer - a mistake done by many people as it throws an warning: [SettingWithCopyWarning]

In [75]:
filt = (df['CITY']== 'Varanasi')
df[filt]['NAME']
#  if we try to edit it

6    GyanSagar
Name: NAME, dtype: object

In [76]:
df[filt]['NAME'] = "Gyan"

C:\Users\Sarthak\AppData\Local\Temp\ipykernel_14884\2415659313.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['NAME'] = "Gyan"

In [77]:
# The method we used above did not change the value  
df

        NAME SECTION REGISTRATION_NO         CITY          STATE
0      Ankit      CH        12018329    Fatehabad       Harayana
1    Ashwani      CH        12016043  Bahadurgarh       Harayana
2   Akshansh      MP        12015923     Gurugram      DeLhi-NCR
3     Gaurav      CH        12014917      Lucknow  Uttar Pradesh
4      Krish      SS        12018275       Jaipur      Rajasthan
5    Sarthak      MP        12018433    Ghaziabad  Uttar Pradesh
6  GyanSagar      SS        12017829     Varanasi  Uttar Pradesh

The value not changing reason is because it is getting set on a temporary object that's just getting tossed and we are trying to change the original data value with the help from it

Major Takewaway: use iloc and loc

In [78]:
df['CITY'] = df['CITY'].str.lower()
df

        NAME SECTION REGISTRATION_NO         CITY          STATE
0      Ankit      CH        12018329    fatehabad       Harayana
1    Ashwani      CH        12016043  bahadurgarh       Harayana
2   Akshansh      MP        12015923     gurugram      DeLhi-NCR
3     Gaurav      CH        12014917      lucknow  Uttar Pradesh
4      Krish      SS        12018275       jaipur      Rajasthan
5    Sarthak      MP        12018433    ghaziabad  Uttar Pradesh
6  GyanSagar      SS        12017829     varanasi  Uttar Pradesh

#### APPLY, MAP, APPLYMAP, REPLACE

In [79]:
#  we use apply to call a function on our values, works both for Dataframes and series
#  aplly used on a series
# it can apply a function to every value of the series

df['NAME'].apply(len)

# BUT, it does not change the values of the series so we have to equate the values

0    5
1    7
2    9
3    6
4    5
5    8
6    9
Name: NAME, dtype: int64

In [80]:
def city_upper(city):
    return city.upper()

In [81]:
df['CITY'] = df['CITY'].apply(city_upper)
df

        NAME SECTION REGISTRATION_NO         CITY          STATE
0      Ankit      CH        12018329    FATEHABAD       Harayana
1    Ashwani      CH        12016043  BAHADURGARH       Harayana
2   Akshansh      MP        12015923     GURUGRAM      DeLhi-NCR
3     Gaurav      CH        12014917      LUCKNOW  Uttar Pradesh
4      Krish      SS        12018275       JAIPUR      Rajasthan
5    Sarthak      MP        12018433    GHAZIABAD  Uttar Pradesh
6  GyanSagar      SS        12017829     VARANASI  Uttar Pradesh

In [82]:
# Lambda Function
df['CITY'] = df['CITY'].apply(lambda x : x.lower())
df

        NAME SECTION REGISTRATION_NO         CITY          STATE
0      Ankit      CH        12018329    fatehabad       Harayana
1    Ashwani      CH        12016043  bahadurgarh       Harayana
2   Akshansh      MP        12015923     gurugram      DeLhi-NCR
3     Gaurav      CH        12014917      lucknow  Uttar Pradesh
4      Krish      SS        12018275       jaipur      Rajasthan
5    Sarthak      MP        12018433    ghaziabad  Uttar Pradesh
6  GyanSagar      SS        12017829     varanasi  Uttar Pradesh

In [83]:
#  Apply on a dataframe
df.apply(len)

# It runs a function on each row or column of the dataframe

NAME               7
SECTION            7
REGISTRATION_NO    7
CITY               7
STATE              7
dtype: int64

#### Its applying a function on each of the series or columns

In [84]:
len(df['NAME'])

7

In [85]:
df.apply(len, axis='columns')
# Its indicating that row 0 has 5 values and so on...

0    5
1    5
2    5
3    5
4    5
5    5
6    5
dtype: int64

In [86]:
df.apply(pd.Series.min)

# It will return all the minimum value of each series of the dataframe whether they are related or not

NAME                  Akshansh
SECTION                     CH
REGISTRATION_NO       12014917
CITY               bahadurgarh
STATE                DeLhi-NCR
dtype: object

also... we can also do the same using lambda function but remember that lambda function works on the series object

In [88]:
df.apply(lambda x : x.min())
# X here is a series and not a value

NAME                  Akshansh
SECTION                     CH
REGISTRATION_NO       12014917
CITY               bahadurgarh
STATE                DeLhi-NCR
dtype: object

Q. if there is way we can apply a function to every individual element in the dataframe (just like as the series but in the whole dataset)?

Ans. Yes- APPLYMAP

In [89]:
# Only works on dataframe
df.applymap(len)

   NAME  SECTION  REGISTRATION_NO  CITY  STATE
0     5        2                8     9      8
1     7        2                8    11      8
2     9        2                8     8      9
3     6        2                8     7     13
4     5        2                8     6      9
5     8        2                8     9     13
6     9        2                8     8     13

In [91]:
df.applymap(str.lower)

        NAME SECTION REGISTRATION_NO         CITY          STATE
0      ankit      ch        12018329    fatehabad       harayana
1    ashwani      ch        12016043  bahadurgarh       harayana
2   akshansh      mp        12015923     gurugram      delhi-ncr
3     gaurav      ch        12014917      lucknow  uttar pradesh
4      krish      ss        12018275       jaipur      rajasthan
5    sarthak      mp        12018433    ghaziabad  uttar pradesh
6  gyansagar      ss        12017829     varanasi  uttar pradesh

#### Now for MAP, a MAP method works only for the series used for substituting each value in the series with another value

In [100]:
df['NAME'].map({'Ankit': 'Anky', 'Ashwani' : 'Ashu'})
#  the value which were not in the dictionary were converted to NaN values

0    Anky
1    Ashu
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
Name: NAME, dtype: object

But if wanted to change only the specified value in dict and not the rest we should use 'REPLACE' method

In [101]:
df['NAME'].replace({'Ankit': 'Anky', 'Ashwani' : 'Ashu'})

# if we wanted to set this to actual column we will use: 
# df['NAME'] = df['NAME'].replace({'Ankit': 'Anky', 'Ashwani' : 'Ashu'})

0         Anky
1         Ashu
2     Akshansh
3       Gaurav
4        Krish
5      Sarthak
6    GyanSagar
Name: NAME, dtype: object